Revit 2024 API
BumpMap.BumpmapType Property
 The property labeled "Bump Type" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string BumpmapType { get; }
Visual Basic
Public Shared ReadOnly Property BumpmapType As String
	Get
Visual C++
public:
static property String^ BumpmapType {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "BumpmapType".
See Also
BumpMap Class
Autodesk.Revit.DB.Visual Namespace